content-org/blog.org
#+HUGO_BASE_DIR: ../
** Project Euler 8: Largest Product in a Series         :brute_force:string:
:PROPERTIES:
:EXPORT_FILE_NAME: 8
:EXPORT_DATE: 2018-06-10
:EXPORT_DESCRIPTION: My solution to problem 8 of Project Euler.
:END:
*** Problem Statement
Find the greatest product of $K$ consecutive digits in the given $N$ digit
number.
*** My Algorithm
We use a brute force solution. There are $N-K+1$ possible $K$-length substrings
of a string of length $N$. We convert the given number to a string, find the
substrings, and multiply the digits in them. We then find the maximal product.
This is easily done with time complexity $O(K(N-K+1))$.
