content/euler/8.md
+++
title = "Project Euler 8: Largest Product in a Series"
author = ["Gautam Manohar"]
description = "My solution to problem 8 of Project Euler."
date = 2018-06-10
tags = ["brute-force", "string"]
categories = ["euler"]
draft = false
+++

## Problem Statement {#problem-statement}

Find the greatest product of \\(K\\) consecutive digits in the given \\(N\\) digit
number.


## My Algorithm {#my-algorithm}

We use a brute force solution. There are \\(N-K+1\\) possible $K$-length substrings
of a string of length \\(N\\). We convert the given number to a string, find the
substrings, and multiply the digits in them. We then find the maximal product.
This is easily done with time complexity \\(O(K(N-K+1))\\).